# Read and Write CSV and XLS files

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('weather_data.csv')

In [3]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

### To handle Excel/xls/xlsx files we need to install 'xlrd'

pip install xlrd

In [8]:
df = pd.read_excel("weather_data.xlsx")

In [9]:
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

# To store Data in CSV or Excel files

In [16]:
#write data to file

#df.to_csv('WritingWeatherToCsv');

#or

#index is the row num, False-> index is not saved to file
df.to_csv('WritingWeatherToCsv.csv',index=False);

#### To write data to xls we need to install openpyxl
pip install openpyxl

In [19]:
df.to_excel('WritingWeatherToExcel.xls',sheet_name='Weather data',index=False);

# Group-By

In [20]:
df = pd.read_csv('weather_data_cities.csv')

In [21]:
df.head()

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny

In [27]:
g = df.groupby('city');
g

In [28]:
for city,city_DataFrame in g:
    print(city)
    print("Data Frame of",city," :")
    print(city_DataFrame)

mumbai
Data Frame of mumbai  :
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
Data Frame of new york  :
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
Data Frame of paris  :
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

Observation: 
"for city,city_DataFrame in g:" 
this line indicates for every city its writning seperate data frame i.e city_DataFrame here.<br>
And index of city is preserved as per the original data

### get_group()

In [30]:
grp = df.groupby('city');

grp.get_group('paris')

         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [31]:
# Max values of attributes

grp.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [32]:
grp.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [33]:
grp.median()

          temperature  windspeed
city
mumbai           88.5        8.5
new york         32.5        7.0
paris            47.5       11.5

In [34]:
grp.std()

          temperature  windspeed
city
mumbai       3.109126   5.057997
new york     3.304038   2.708013
paris        5.315073   5.251984

In [35]:
grp.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# Concatenate Data Frames

In [44]:
import pandas as pd

In [47]:
india_weather = pd.DataFrame({
    "city": ["Hyderabad","Banglore","Pune"],
    "temperature":[33,28,40],
    "humidity":[80,60,78]
});
india_weather

        city  humidity  temperature
0  Hyderabad        80           33
1   Banglore        60           28
2       Pune        78           40

In [48]:
US_weather = pd.DataFrame({
    "city": ["new york","washington","arizona"],
    "temperature":[3,2,40],
    "humidity":[20,70,38]
});
US_weather

         city  humidity  temperature
0    new york        20            3
1  washington        70            2
2     arizona        38           40

In [50]:
df = pd.concat([india_weather,US_weather],ignore_index=True)
df

         city  humidity  temperature
0   Hyderabad        80           33
1    Banglore        60           28
2        Pune        78           40
3    new york        20            3
4  washington        70            2
5     arizona        38           40

In [53]:
#row wise concatenation
df = pd.concat([india_weather,US_weather],axis=1,ignore_index=True)
df

           0   1   2           3   4   5
0  Hyderabad  80  33    new york  20   3
1   Banglore  60  28  washington  70   2
2       Pune  78  40     arizona  38  40

# Merge Data Frames like Join in SQL

In [56]:
temp_df = pd.DataFrame({
    "city": ["Hyderabad","Banglore","Pune"],
    "temperature":[33,28,40]
});
temp_df

        city  temperature
0  Hyderabad           33
1   Banglore           28
2       Pune           40

In [65]:
humidity_df = pd.DataFrame({
     "city": ["Hyderabad","Banglore","Chennai"],
    "humidity":[63,78,40]
})
humidity_df

        city  humidity
0  Hyderabad        63
1   Banglore        78
2    Chennai        40

In [66]:
# Merging df's on city

In [67]:
df = pd.merge(temp_df,humidity_df,on='city')
df

        city  temperature  humidity
0  Hyderabad           33        63
1   Banglore           28        78

# Outer Join

In [68]:
df = pd.merge(temp_df,humidity_df,on='city',how='outer')
df

        city  temperature  humidity
0  Hyderabad         33.0      63.0
1   Banglore         28.0      78.0
2       Pune         40.0       NaN
3    Chennai          NaN      40.0

# Left Join

In [70]:
df = pd.merge(temp_df,humidity_df,on='city',
              how='left')
df

        city  temperature  humidity
0  Hyderabad           33      63.0
1   Banglore           28      78.0
2       Pune           40       NaN

In [71]:
df = pd.merge(temp_df,humidity_df,on='city',
              how='right')
df

        city  temperature  humidity
0  Hyderabad         33.0        63
1   Banglore         28.0        78
2    Chennai          NaN        40

# Numerical Indexing(.loc vs iloc)

In [72]:
df = pd.DataFrame([1,2,3,4],index=[20,21,1,2])
df

    0
20  1
21  2
1   3
2   4

# Accessing Data using custome index or using row index

In [74]:
df.loc[21]

0    2
Name: 21, dtype: int64

In [78]:
df.iloc[2] #row index

0    3
Name: 1, dtype: int64

In [79]:
df.iloc[:2]

    0
20  1
21  2